//* keyword rosetta control shell: jcl / a
//* decoy: config reads stay in prose only
//IMP2 INCLUDE MEMBER=b
//PROBEGLOB EXEC ROSPROC,PARM='G'
//PROBETEST EXEC ROSPROC,COND=(8,LE),PARM='T'
//PROBESAFE EXEC ROSPROC,COND=(4,LT),PARM='S'
