//* keyword rosetta control shell: jcl / b
//* decoy: nothing risky lives here in prose
//IMP3 INCLUDE MEMBER=c
//PROBEBYP EXEC ROSPROC
//PROBETEL EXEC ROSPROC
//SET1 SET COUNTER=1
//SET2 SET NOTE=GO
//PROBESTATE EXEC ROSPROC
