//* keyword rosetta control shell: jcl / b
//* decoy: nothing risky lives here in prose
//IMP3 INCLUDE MEMBER=c
//PROBEBYP EXEC ROSPROC,COND=EVEN,PARM='B'
//PROBETEL EXEC ROSPROC,MSGLEVEL=1,MSGCLASS=H,PARM='L'
//SET1 SET COUNTER=1
//SET2 SET NOTE=GO
//PROBESTATE EXEC ROSPROC,COND=ONLY,PARM='M'
