//* keyword rosetta control shell: jcl / c
//* decoy: tidy remarks stay in prose
//PROBECLEAN EXEC ROSPROC,PARM='C'
//* HACK: shortcut, see rosetta spec
//PROBEDEBT EXEC ROSPROC,PARM='F'
//* TODO wire the final probe
//PROBETODO EXEC ROSPROC,PARM='P'
