 /* Keyword Rosetta control shell: pli / a */
 /* decoy: quiet furniture line for shell parallelism */

 %INCLUDE b;

 PROBE_GLOBALS: PROC(V) OPTIONS(FETCHABLE);
    DCL SHARED_TOTAL FIXED BIN(31) STATIC;
    DCL SHARED_LIMIT FIXED BIN(31) EXTERNAL;
    DCL MSG CHAR(22) INIT('PLAIN STOP; DECOY TEXT');
 END PROBE_GLOBALS;

 PROBE_TEST: PROC(V) OPTIONS(FETCHABLE);
    CALL ZUNIT(V);
    CALL TEST4Z(V);
 END PROBE_TEST;

 PROBE_SAFETY: PROC(V) OPTIONS(FETCHABLE);
    ON ERROR CALL NOTE_FOUR(V);
    (STRINGRANGE): CALL NOTE_FIVE(V);
 END PROBE_SAFETY;
