 /* Keyword Rosetta control shell: pli / b */
 /* decoy: quiet furniture line for shell parallelism */

 %INCLUDE c;

 PROBE_BYPASS: PROC(V) OPTIONS(FETCHABLE);
    (NOSIZE): CALL NOTE_SIX(V);
    ON CONVERSION;
 END PROBE_BYPASS;

 PROBE_TELEMETRY: PROC(V) OPTIONS(FETCHABLE);
    CALL PLIDUMP(V);
    CALL CEEMOUT(V);
 END PROBE_TELEMETRY;

 PROBE_STATE: PROC(V) OPTIONS(FETCHABLE);
    DCL LOCAL_TALLY FIXED BIN(31) INIT(0);
    LOCAL_TALLY = LOCAL_TALLY + 1;
    LOCAL_TALLY = LOCAL_TALLY * 2;
 END PROBE_STATE;
